freebsd-doc-ru/freebsd-man-ru/man/15.0R/ru.UTF-8/man1/cmp.1
.\" Copyright (c) 1987, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Institute of Electrical and Electronics Engineers, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)cmp.1	8.1 (Berkeley) 6/6/93
.\"
.\" FRDP path ./usr.bin/cmp/cmp.1
.\" FRDP githash bdcbfde31e8e9b343f113a1956384bdf30d1ed62
.\" FRDP hash256 283bde3967bbed7eaf955893f580e9c0ccd9252994b3578280de3ef53dc9ab73
.Dd 23 сентября 2021
.Dt CMP 1
.Os
.Sh ИМЯ
.Nm cmp
.Nd сравнить два файла
.Sh СИНТАКСИС
.Nm
.Op Fl l | s | x
.Op Fl bhz
.Op Fl -ignore-initial Ns Cm = Ns Ar num1 Ns Op :num2
.Op Fl -bytes Ns Cm = Ns Ar num
.Ar файл1 файл2
.Op Ar пропуск1 Op Ar пропуск2
.Sh ОПИСАНИЕ
Утилита
.Nm
сравнивает два файла любого типа и выводит результаты
в стандартный вывод.
По умолчанию,
.Nm
не выводит ничего, если файлы идентичны; если они различаются, сообщается
байт и номер строки, в котором обнаружено первое различие.
.Pp
Нумерация байтов и строк начинается с единицы.
.Pp
Доступны следующие опции:
.Bl -tag -width indent
.It Fl b , Fl -print-bytes
Выводить каждый байт при обнаружении различия.
.It Fl h
Не следовать за символическими ссылками.
.It Fl i Ar num1 Ns Oo :num2 Oc , Fl -ignore-initial= Ns Ar num1 Ns Op :num2
Пропустить
.Ar num1
байт в
.Ar файл1 ,
и, опционально, пропустить
.Ar num2
байт в
.Ar файл2 .
Если
.Ar num2
не указан, то
.Ar num1
применяется к обоим файлам,
.Ar файл1
и
.Ar файл2 .
.It Fl l , Fl -verbose
Выводить номер байта (десятичный) и различающиеся
значения байтов (восьмеричные) для каждого различия.
.It Fl n Ar num , Fl -bytes= Ns num
Сравнивать только до
.Ar num
байт.
.It Fl s , Fl -silent , Fl -quiet
Не выводить ничего для различающихся файлов; возвращать только
статус выхода.
.It Fl x
Подобно
.Fl l ,
но выводит в шестнадцатеричном формате и использует ноль в качестве индекса
для первого байта в файлах.
.It Fl z
Для обычных файлов сначала сравнивать размеры файлов, и завершать сравнение с ошибкой, если они
не равны.
.El
.Pp
Необязательные аргументы
.Ar пропуск1
и
.Ar пропуск2
представляют собой смещения в байтах от начала
.Ar файл1
и
.Ar файл2
соответственно, с которых начнётся сравнение.
Смещение по умолчанию десятичное, но может быть выражено в шестнадцатеричном
или восьмеричном виде, если предварить его префиксом ``0x'' или ``0''.
.Pp
.Ar пропуск1
и
.Ar пропуск2
также могут быть указаны с суффиксами размера SI.
.Sh СТАТУС ВЫХОДА
Утилита
.Nm
завершает работу со следующими значениями:
.Bl -tag -width 4n
.It 0
Файлы идентичны.
.It 1
Файлы различаются; это включает случай,
когда один файл идентичен первой части
другого.
В последнем случае, если опция
.Fl s
не была указана,
.Nm
записывает в стандартную ошибку, что в более коротком файле достигнут конец файла
(до обнаружения каких-либо различий).
.It >1
Произошла ошибка.
.El
.Sh ПРИМЕРЫ
Предположим, существует файл с именем
.Pa example.txt
и следующим содержимым:
.Bd -literal -offset indent
a
b
c
.Ed
.Pp
Сравнить стандартный ввод с
.Pa example.txt :
.Bd -literal -offset indent
.Ed
.Pp
То же, что и выше, но с внесением изменения в третий байт стандартного ввода.
Показать номер байта (десятичный) и различающийся байт (восьмеричный):
.Bd -literal -offset indent
     3 122 142
.Ed
.Pp
Сравнить размеры файлов
.Pa example.txt
и
.Pa /boot/loader.conf
и вернуть 1, если они не равны.
Заметим, что
.Fl z
можно использовать только с обычными файлами:
.Bd -literal -offset indent
$ cmp -z example.txt /boot/loader.conf
example.txt /boot/loader.conf differ: size
.Ed
.Pp
Сравнить стандартный ввод с
.Pa example.txt ,
пропуская первые 4 байта стандартного ввода и первые 2 байта
.Pa example.txt :
.Bd -literal -offset indent
.Ed
.Sh СМ. ТАКЖЕ
.Xr diff 1 ,
.Xr diff3 1
.Sh СТАНДАРТЫ
Ожидается, что утилита
.Nm
совместима со
.St -p1003.2 .
Опции
.Fl b ,
.Fl h ,
.Fl i ,
.Fl n ,
.Fl x ,
и
.Fl z
являются расширениями стандарта.
Аргументы
.Ar пропуск1
и
.Ar пропуск2
являются расширениями стандарта.
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.At v1 .
.Sh ИЗВЕСТНЫЕ ОШИБКИ
Фраза
.Dq суффиксы размера SI
выше относится к традиционной системе степеней двойки, как описано в
.Xr expand_number 3 .
