freebsd-doc-ru/freebsd-man-ru/man/15.0R/ru.UTF-8/man1/cu.1
.\"-
.\" SPDX-License-Identifier: BSD-3-Clause
.\"
.\"	$OpenBSD: cu.1,v 1.3 2006/06/07 06:35:59 mbalmer Exp $
.\"
.\" Copyright (c) 1980, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)tip.1	8.4 (Berkeley) 4/18/94
.\"
.\" FRDP path ./usr.bin/tip/tip/cu.1
.\" FRDP githash 4d12c7b9df660b15580ff3b07ef5570d1cab958a
.\" FRDP hash256 bdf09eff74d34b8965a5d83c2900528bfd8d16dbd2011b59fbc321765efd874e
.Dd 22 апреля 2017
.Dt CU 1
.Os
.Sh ИМЯ
.Nm cu
.Nd вызов UNIX через последовательную линию
.Sh СИНТАКСИС
.Nm
.Op Fl ehot
.Op Fl a Ar acu
.Op Fl l Ar линия
.Op Fl s Ar скорость | Fl Ar скорость
.Op Ar номер-телефона
.Sh ОПИСАНИЕ
Утилита
.Nm
устанавливает полнодуплексное соединение с другой машиной, создавая видимость непосредственного входа в систему на удалённом ЦПУ.
Само собой разумеется, у вас должна быть учётная запись на машине (или её эквивалент), к которой вы хотите подключиться.
.Pp
Параметры следующие:
.Bl -tag -width indent
.It Fl a Ar acu
Установить acu.
.It Fl e
Использовать чётность.
Если заданы и
.Fl e
и
.Fl o , то контроль чётности не используется (по умолчанию).
.It Fl h
Локальный эхо-сигнал символов (полудуплексный режим).
.It Fl l Ar линия
Указать используемую линию.
Допустимы любые формы, такие как
.Pa cuau0
или
.Pa /dev/cuau0 .
.It Fl o
Использовать нечётность.
Если заданы и
.Fl e
и
.Fl o , то контроль чётности не используется (по умолчанию).
.It Fl s Ar скорость | Fl Ar скорость
Установить скорость соединения.
По умолчанию 9600.
.It Fl t
Подключиться через проводное соединение к хосту на коммутируемой линии.
.El
.Pp
Введённые символы обычно передаются напрямую на удалённую машину (которая также выполняет эхо-сигнал).
Тильда
.Pq Ql ~ ,
появляющаяся первым символом строки, является сигналом экранирования; распознаются следующие команды:
.Bl -tag -width indent
.It Ic ~^D No или Ic ~.
Разорвать соединение и выйти.
Только соединение разрывается — сеанс входа в систему не завершается.
.It Ic ~c Op Ar имя
Сменить каталог на
.Ar имя
(без аргумента подразумевает переход в домашний каталог).
.It Ic ~!
Выйти в оболочку (выход из оболочки вернёт в
.Nm ) .
.It Ic ~>
Скопировать файл с локальной на удалённую машину.
Утилита
.Nm
запрашивает имя локального файла для передачи.
.It Ic ~<
Скопировать файл с удалённой на локальную машину.
Утилита
.Nm
сначала запрашивает имя файла для отправки, затем команду для выполнения на удалённой машине.
.It Ic ~p Ar из Op Ar в
Отправить файл на удалённый хост
.Ux .
Эта команда заставляет удалённую систему
.Ux
выполнить следующую строку команд, передавая ей файл
.Ar из :
.Pp
.Pp
Если файл
.Ar в
не указан, используется имя файла
.Ar из .
Эта команда фактически является специфичной для
.Ux
версией команды
.Ic ~> .
.It Ic ~t Ar из Op Ar в
Получить файл с удалённого хоста
.Ux .
Как и в команде
.Ic ~p ,
файл
.Ar в
по умолчанию равен имени файла
.Ar из , если не указан иначе.
Удалённый хост выполняет следующую строку команд, чтобы отправить файл в
.Nm :
.Pp
.It Ic ~|
Перенаправить вывод удалённой команды в локальный процесс
.Ux .
Строка команд, отправленная в локальную систему
.Ux , обрабатывается оболочкой.
.It Ic ~$
Перенаправить вывод локального процесса
.Ux
на удалённый хост.
Строка команд, отправленная в локальную систему
.Ux , обрабатывается оболочкой.
.It Ic ~C
Породить дочерний процесс в локальной системе для выполнения специальных протоколов, таких как
.Tn XMODEM .
Дочерняя программа будет запущена со следующей организацией файловых дескрипторов:
.Bd -literal -offset indent
0 <-> удалённый tty ввод
1 <-> удалённый tty вывод
2 <-> локальный tty stderr
.Ed
.It Ic ~#
Отправить
.Dv BREAK
на удалённую систему.
Для систем, которые не поддерживают необходимый вызов
.Fn ioctl ,
прерывание имитируется последовательностью изменений скорости линии и символов
.Dv DEL .
.It Ic ~s
Установить переменную (см. обсуждение ниже).
.It Ic ~v
Вывести список всех переменных и их значений (если установлены).
.It Ic ~^Z
Остановить
.Nm
(доступно только при управлении заданиями).
.It Ic ~^Y
Остановить только сторону вывода
.Nm
(доступно только при управлении заданиями); сторона вывода
.Nm ,
которая отображает вывод с удалённого хоста, продолжает работать.
.It Ic ~?
Получить сводку по экранирующим последовательностям с тильдой.
.El
.Pp
Когда
.Nm
запрашивает аргумент, например, при настройке передачи файла, введённую строку можно редактировать стандартными символами стирания и удаления.
Пустая строка в ответ на запрос или прерывание прервёт диалог и вернёт пользователя к удалённой машине.
.Pp
Утилита
.Nm
защищает от подключения нескольких пользователей к удалённой системе, открывая модемы и терминальные линии с эксклюзивным доступом, а также соблюдая протокол блокировки, используемый
.Xr uucico 8 Pq Pa ports/net/freebsd-uucp .
.Pp
Во время передачи файлов
.Nm
предоставляет текущий счётчик количества переданных строк.
При использовании команд
.Ic ~>
и
.Ic ~< ,
переменные
.Va eofread
и
.Va eofwrite
используются для распознавания конца файла при чтении и указания конца файла при записи (см. ниже).
Передача файлов обычно зависит от аппаратного управления потоком или тандемного режима для управления потоком данных.
Если удалённая система не поддерживает аппаратное управление потоком или тандемный режим, можно установить
.Va echocheck ,
чтобы указать, что
.Nm
должен синхронизироваться с удалённой системой по эхо-сигналу каждого переданного символа.
.Pp
Когда
.Nm
должен набрать номер телефона для подключения к системе, он будет выводить различные сообщения, указывающие на его действия.
Утилита
.Nm
поддерживает множество автонабирателей и модемов с возможностью
.Va at
в описаниях систем.
.Pp
Поддержка Ventel 212+ (ventel), Hayes AT-style (hayes), USRobotics Courier (courier), Telebit T3000 (t3000) и Racal-Vadic 831 (vadic) включена по умолчанию.
.Pp
Поддержка Bizcomp 1031[fw] (biz31[fw]), Bizcomp 1022[fw] (biz22[fw]), DEC DF0[23]-AC (df0[23]), DEC DN-11 (dn11) и Racal-Vadic 3451 (v3451) может быть добавлена путём перекомпиляции
.Nm
с соответствующими директивами.
.Pp
Обратите внимание, что если поддержка как Racal-Vadic 831, так и 3451 включена, они обозначаются как v831 и v3451 соответственно.
Если поддерживается только один из двух, он обозначается как vadic.
.Ss Переменные
Утилита
.Nm
поддерживает набор переменных, которые управляют её работой.
Некоторые из этих переменных доступны только для чтения обычным пользователям (root может изменить всё, что представляет интерес).
Переменные могут отображаться и устанавливаться с помощью экранирующей последовательности
.Ic ~s .
Синтаксис переменных построен по образцу
.Xr vi 1
и
.Xr Mail 1 .
Указание
.Dq Li all
в качестве аргумента команды set отображает все переменные, доступные для чтения пользователем.
Кроме того, пользователь может запросить отображение конкретной переменной, добавив
.Ql \&?
в конец.
Например,
.Dq Li escape?
выводит текущий символ экранирования.
.Pp
Переменные бывают числовыми, строковыми, символьными или логическими.
Логические переменные устанавливаются простым указанием их имени; они могут быть сброшены путём добавления
.Ql \&!
к имени.
Другие типы переменных устанавливаются путём добавления
.Ql =
и значения.
Всё присваивание не должно содержать пробелов.
Одна команда set может использоваться для запроса, а также установки нескольких переменных.
Некоторые распространённые переменные имеют сокращения.
Ниже приведён список распространённых переменных, их сокращений и значений по умолчанию:
.Bl -tag -width indent
.It Va baudrate
.Pq Vt num
Скорость передачи, на которой было установлено соединение; сокращённо
.Va ba .
.It Va beautify
.Pq Vt bool
Отбрасывать непечатаемые символы при записи сеанса; сокращённо
.Va be .
.It Va dialtimeout
.Pq Vt num
При наборе номера телефона время (в секундах) ожидания установления соединения; сокращённо
.Va dial .
.It Va echocheck
.Pq Vt bool
Синхронизироваться с удалённым хостом во время передачи файла, ожидая эхо-сигнал последнего переданного символа; по умолчанию
.Cm выкл .
.It Va eofread
.Pq Vt str
Набор символов, означающих конец передачи во время команды передачи файла
.Ic ~< ;
сокращённо
.Va eofr .
.It Va eofwrite
.Pq Vt str
Строка, отправляемая для указания конца передачи во время команды передачи файла
.Ic ~> ;
сокращённо
.Va eofw .
.It Va eol
.Pq Vt str
Набор символов, указывающих конец строки.
Утилита
.Nm
будет распознавать символы экранирования только после конца строки.
.It Va escape
.Pq Vt char
Символ префикса команды (экранирования); сокращённо
.Va es ;
значение по умолчанию
.Ql ~ .
.It Va exceptions
.Pq Vt str
Набор символов, которые не должны отбрасываться из-за переключателя beautify; сокращённо
.Va ex ;
значение по умолчанию
.Dq Li \et\en\ef\eb .
.It Va force
.Pq Vt char
Символ, используемый для принудительной передачи литеральных данных; сокращённо
.Va fo ;
значение по умолчанию
.Ql ^P .
.It Va framesize
.Pq Vt num
Объём данных (в байтах) для буферизации между записями в файловую систему при приёме файлов; сокращённо
.Va fr .
.It Va hardwareflow
.Pq Vt bool
Включено ли аппаратное управление потоком (CRTSCTS) для соединения; сокращённо
.Va hf ;
значение по умолчанию
.Cm выкл .
.It Va host
.Pq Vt str
Имя хоста, к которому вы подключены; сокращённо
.Va ho .
.It Va linedisc
.Pq Vt num
Используемая дисциплина линии; сокращённо
.Va ld .
.It Va prompt
.Pq Vt char
Символ, указывающий конец строки на удалённом хосте; сокращённо
.Va pr ;
значение по умолчанию
.Ql \en .
Это значение используется для синхронизации во время передачи данных.
Счётчик строк, переданных во время команды передачи файла, основан на получении этого символа.
.It Va raise
.Pq Vt bool
Режим отображения в верхний регистр; сокращённо
.Va ra ;
значение по умолчанию
.Cm выкл .
Когда этот режим включён, все строчные буквы будут преобразованы в прописные
.Nm
для передачи на удалённую машину.
.It Va raisechar
.Pq Vt char
Входной символ, используемый для переключения режима отображения в верхний регистр; сокращённо
.Va rc ;
не установлен по умолчанию.
.It Va record
.Pq Vt str
Имя файла, в который записывается сценарий сеанса; сокращённо
.Va rec .
.It Va script
.Pq Vt bool
Режим записи сеанса; сокращённо
.Va sc ;
по умолчанию
.Cm выкл .
Когда
.Va script
равно
.Cm вкл ,
.Nm
будет записывать всё, передаваемое удалённой машиной, в файл записи сценария, указанный в
.Va record .
Если переключатель
.Va beautify
включён, в файл сценария будут включены только печатаемые символы
.Tn ASCII
(символы между 040 и 0177).
Переменная
.Va exceptions
используется для указания символов, которые являются исключением из обычных правил beautify.
.It Va tabexpand
.Pq Vt bool
Разворачивать табуляции в пробелы во время передачи файлов; сокращённо
.Va tab ;
значение по умолчанию
.Cm ложь .
Каждая табуляция разворачивается в 8 пробелов.
.It Va tandem
.Pq Vt bool
Использовать управление потоком XON/XOFF для регулирования данных с удалённого хоста; сокращённо
.Va ta .
Значение по умолчанию
.Cm истина .
.It Va verbose
.Pq Vt bool
Подробный режим; сокращённо
.Va verb ;
по умолчанию
.Cm истина .
Когда подробный режим включён,
.Nm
выводит сообщения при наборе номера, показывает текущее количество переданных строк во время операций передачи файлов и другое.
.El
.Sh ОКРУЖЕНИЕ
.Bl -tag -width indent
.It Ev HOME
Домашний каталог для использования с командой
.Ic ~c .
.It Ev SHELL
Имя оболочки для использования с командой
.Ic ~! ;
значение по умолчанию
.Dq Li /bin/sh .
.El
.Sh ФАЙЛЫ
.It Pa /var/log/aculog
журнал доступа к линии
.It Pa /var/spool/lock/LCK..*
файл блокировки для предотвращения конфликтов с
.Xr uucp 1 Pq Pa ports/net/freebsd-uucp
.El
.Sh ПРИМЕРЫ
Подключиться к первому последовательному USB-порту на скорости 115200 бод:
.Bd -literal -offset indent
cu -s 115200 -l /dev/cuaU0
.Ed
.Sh СМ. ТАКЖЕ
.Xr tip 1
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.Bx 4.2 .
.Sh ИЗВЕСТНЫЕ ОШИБКИ
Полный набор переменных не документирован и, вероятно, должен быть сокращён.
