freebsd-doc-ru/freebsd-man-ru/man/15.0R/ru.UTF-8/man1/diff.1
.\" $OpenBSD: diff.1,v 1.47 2015/11/24 19:35:41 jmc Exp $
.\"
.\" Copyright (c) 1980, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)diff.1	8.1 (Berkeley) 6/30/93
.\"
.\" FRDP path ./usr.bin/diff/diff.1
.\" FRDP githash e945411697cfaf9e57ef9ffdf9d35dfd9778612b
.\" FRDP hash256 1329b8d8fe2f48af80435c97676568a8d3ef1509f7f98ca01803f7a824d434e3
.Dd 26 июля 2024
.Dt DIFF 1
.Os
.Sh ИМЯ
.Nm diff
.Nd программа сравнения файлов и каталогов
.Sh СИНТАКСИС
.Nm diff
.Op Fl aBbdipTtw
.Oo
.Fl c | e | f |
.Fl n | q | u | y
.Oc
.Op Fl -brief
.Op Fl -changed-group-format Ar GFMT
.Op Fl -ed
.Op Fl -expand-tabs
.Op Fl -forward-ed
.Op Fl -ignore-all-space
.Op Fl -ignore-case
.Op Fl -ignore-space-change
.Op Fl -initial-tab
.Op Fl -minimal
.Op Fl -no-ignore-file-name-case
.Op Fl -normal
.Op Fl -rcs
.Op Fl -show-c-function
.Op Fl -starting-file
.Op Fl -speed-large-files
.Op Fl -strip-trailing-cr
.Op Fl -tabsize Ar число
.Op Fl -text
.Op Fl -unified
.Op Fl I Ar шаблон | Fl -ignore-matching-lines Ar шаблон
.Op Fl L Ar метка | Fl -label Ar метка
.Ar файл1 файл2
.Nm diff
.Op Fl aBbdilpTtw
.Op Fl I Ar шаблон | Fl -ignore-matching-lines Ar шаблон
.Op Fl L Ar метка | Fl -label Ar метка
.Op Fl -brief
.Op Fl -changed-group-format Ar GFMT
.Op Fl -ed
.Op Fl -expand-tabs
.Op Fl -forward-ed
.Op Fl -ignore-all-space
.Op Fl -ignore-case
.Op Fl -ignore-space-change
.Op Fl -initial-tab
.Op Fl -minimal
.Op Fl -no-ignore-file-name-case
.Op Fl -normal
.Op Fl -paginate
.Op Fl -rcs
.Op Fl -show-c-function
.Op Fl -speed-large-files
.Op Fl -starting-file
.Op Fl -strip-trailing-cr
.Op Fl -tabsize Ar число
.Op Fl -text
.Fl C Ar число | -context Ar число
.Ar файл1 файл2
.Nm diff
.Op Fl aBbdiltw
.Op Fl I Ar шаблон | Fl -ignore-matching-lines Ar шаблон
.Op Fl -brief
.Op Fl -changed-group-format Ar GFMT
.Op Fl -ed
.Op Fl -expand-tabs
.Op Fl -forward-ed
.Op Fl -ignore-all-space
.Op Fl -ignore-case
.Op Fl -ignore-space-change
.Op Fl -initial-tab
.Op Fl -minimal
.Op Fl -no-ignore-file-name-case
.Op Fl -normal
.Op Fl -paginate
.Op Fl -rcs
.Op Fl -show-c-function
.Op Fl -speed-large-files
.Op Fl -starting-file
.Op Fl -strip-trailing-cr
.Op Fl -tabsize Ar число
.Op Fl -text
.Fl D Ar строка | Fl -ifdef Ar строка
.Ar файл1 файл2
.Nm diff
.Op Fl aBbdilpTtw
.Op Fl I Ar шаблон | Fl -ignore-matching-lines Ar шаблон
.Op Fl L Ar метка | Fl -label Ar метка
.Op Fl -brief
.Op Fl -changed-group-format Ar GFMT
.Op Fl -ed
.Op Fl -expand-tabs
.Op Fl -forward-ed
.Op Fl -ignore-all-space
.Op Fl -ignore-case
.Op Fl -ignore-space-change
.Op Fl -initial-tab
.Op Fl -minimal
.Op Fl -no-ignore-file-name-case
.Op Fl -normal
.Op Fl -paginate
.Op Fl -rcs
.Op Fl -show-c-function
.Op Fl -speed-large-files
.Op Fl -starting-file
.Op Fl -strip-trailing-cr
.Op Fl -tabsize Ar число
.Op Fl -text
.Fl U Ar число | Fl -unified Ar число
.Ar файл1 файл2
.Nm diff
.Op Fl aBbdilNPprsTtw
.Oo
.Fl c | e | f |
.Fl n | q | u
.Oc
.Op Fl -brief
.Op Fl -changed-group-format Ar GFMT
.Op Fl -context
.Op Fl -ed
.Op Fl -expand-tabs
.Op Fl -forward-ed
.Op Fl -ignore-all-space
.Op Fl -ignore-case
.Op Fl -ignore-space-change
.Op Fl -initial-tab
.Op Fl -minimal
.Op Fl -new-file
.Op Fl -no-ignore-file-name-case
.Op Fl -normal
.Op Fl -paginate
.Op Fl -rcs
.Op Fl -recursive
.Op Fl -report-identical-files
.Op Fl -show-c-function
.Op Fl -speed-large-files
.Op Fl -strip-trailing-cr
.Op Fl -tabsize Ar число
.Op Fl -text
.Op Fl -unidirectional-new-file
.Op Fl -unified
.Op Fl I Ar шаблон | Fl -ignore-matching-lines Ar шаблон
.Bk -words
.Op Fl L Ar метка | Fl -label Ar метка
.Op Fl S Ar имя | Fl -starting-file Ar имя
.Op Fl X Ar файл | Fl -exclude-from Ar файл
.Op Fl x Ar шаблон | Fl -exclude Ar шаблон
.Ek
.Ar каталог1 каталог2
.Nm diff
.Op Fl aBbditwW
.Op Fl -expand-tabs
.Op Fl -ignore-all-space
.Op Fl -ignore-blank-lines
.Op Fl -ignore-case
.Op Fl -minimal
.Op Fl -no-ignore-file-name-case
.Op Fl -strip-trailing-cr
.Op Fl -suppress-common-lines
.Op Fl -tabsize Ar число
.Op Fl -text
.Op Fl -width
.Fl y | Fl -side-by-side
.Ar файл1 файл2
.Sh ОПИСАНИЕ
Утилита
.Nm
сравнивает содержимое
.Ar файла1
и
.Ar файла2
и выводит в стандартный вывод список изменений, необходимых для
преобразования одного файла в другой.
Если файлы идентичны, вывод не производится.
.Pp
Параметры вывода (взаимоисключающие):
.Bl -tag -width Ds
.It Fl C Ar число Fl -context Ar число
Как
.Fl c
, но создаёт сравнение с
.Ar числом
строк контекста.
.It Fl c
Создаёт сравнение с 3 строками контекста.
С
.Fl c
формат вывода слегка изменён:
вывод начинается с идентификации участвующих файлов и
даты их создания, а затем каждое изменение отделяется
строкой с пятнадцатью
.Li * Ns .
Строки, удалённые из
.Ar файла1
, помечаются
.Sq \&-\ \& ;
добавленные в
.Ar файл2
помечаются
.Sq +\ \& .
Строки, которые изменены от одного файла к другому, помечаются в
обоих файлах как
.Sq !\ \& .
Изменения, находящиеся в пределах 3 строк друг от друга, группируются вместе при
выводе.
.It Fl D Ar строка Fl -ifdef Ar строка
Создаёт объединённую версию
.Ar файла1
и
.Ar файла2
в стандартном выводе, с включёнными директивами препроцессора C, так что
компиляция результата без определения
.Ar строки
эквивалентна компиляции
.Ar файла1 ,
в то время как определение
.Ar строки
даст
.Ar файл2 .
.It Fl e -ed
Генерирует вывод в форме, пригодной для ввода в утилиту редактора
.Xr ed 1 ,
которая затем может быть использована для преобразования файла1 в файл2.
.Pp
Дополнительные команды добавляются к выводу при сравнении каталогов с
.Fl e ,
так что результат представляет собой
сценарий
.Xr sh 1
для преобразования текстовых файлов, общих для двух каталогов,
из их состояния в
.Ar каталоге1
в их состояние в
.Ar каталоге2 .
.It Fl f -forward-ed
Идентичный вывод, как у флага
.Fl e ,
но в обратном порядке.
Он не может быть обработан
.Xr ed 1 .
.It Fl n
Создаёт сценарий, подобный сценарию
.Fl e ,
но в обратном порядке и со счётчиком изменённых строк для каждой
команды вставки или удаления.
Это форма, используемая rcsdiff.
.It Fl q -brief
Просто выводит строку, когда файлы различаются.
Не выводит список изменений.
.It Fl U Ar число Fl -unified Ar число
Как
.Fl u
, но создаёт сравнение с
.Ar числом
строк контекста.
.It Fl u
Создаёт
.Em унифицированное
сравнение с 3 строками контекста.
Унифицированное сравнение похоже на контекстное сравнение, создаваемое параметром
.Fl c .
Однако, в отличие от
.Fl c ,
все строки, подлежащие изменению (добавленные и/или удалённые), присутствуют в
едином разделе.
.It Fl y Fl -side-by-side
Вывод в два столбца с маркером между ними.
Маркер может быть одним
из следующих:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It пробел
Соответствующие строки идентичны.
.It '|'
Соответствующие строки различны.
.It '<'
Файлы различаются, и только первый файл содержит строку.
.It '>'
Файлы различаются, и только второй файл содержит строку.
.El
.El
.Pp
Параметры сравнения:
.Bl -tag -width Ds
.It Fl a -text
Обрабатывать все файлы как текст ASCII.
Обычно
.Nm
просто выведет
.Dq Двоичные файлы ... различаются
если файлы содержат двоичные символы.
Использование этого параметра заставляет
.Nm
генерировать сравнение.
.It Fl B Fl -ignore-blank-lines
Игнорировать блоки, содержащие только пустые строки.
.It Fl b -ignore-space-change
Игнорировать завершающие пробелы (пробелы и табуляции), а другие
последовательности пробелов считать равными.
.It Fl d -minimal
Пытаться всеми силами создать как можно меньшее сравнение.
Это может потребовать много вычислительной мощности и памяти при обработке
больших файлов со множеством изменений.
.It Fl I Ar шаблон Fl -ignore-matching-lines Ar шаблон
Игнорировать изменения, вставки и удаления, строки которых соответствуют
расширенному регулярному выражению
.Ar шаблон .
Можно указать несколько
.Fl I
шаблонов.
Все строки в изменении должны соответствовать какому-либо шаблону, чтобы изменение было
проигнорировано.
См.
.Xr re_format 7
для получения дополнительной информации о шаблонах регулярных выражений.
.It Fl i -ignore-case
Игнорировать регистр букв.
Например,
.Dq A
будет сравниваться как равное
.Dq a .
.It Fl l -paginate
Пропускать вывод через
.Xr pr 1
для разбиения на страницы.
.It Fl L Ar метка Fl -label Ar метка
Выводить
.Ar метку
вместо имени первого (и второго, если этот параметр указан дважды)
файла и времени в заголовке контекстного или унифицированного сравнения.
.It Fl p -show-c-function
С унифицированными и контекстными сравнениями показывать для каждого изменения
первые 40 символов последней строки перед контекстом, начинающейся
с буквы, подчёркивания или знака доллара.
Для исходного кода на C, следующего стандартным соглашениям о форматировании, это
покажет прототип функции, к которой применяется изменение.
.It Fl T -initial-tab
Выводить табуляцию вместо пробела перед остальной частью строки для
обычного, контекстного или унифицированного форматов вывода.
Это делает выравнивание табуляций в строке единообразным.
.It Fl t -expand-tabs
Будет расширять табуляции в строках вывода.
Обычный вывод или вывод с
.Fl c
добавляет символ(ы) в начало каждой строки, что может нарушить
отступы исходных строк и затруднить интерпретацию
выводящегося списка.
Этот параметр сохранит отступы исходного кода.
.It Fl w -ignore-all-space
Похож на
.Fl b -ignore-space-change
, но заставляет полностью игнорировать пробелы (пробелы и табуляции).
Например,
.Dq if (\ \&a == b \&)
будет сравниваться как равное
.Dq if(a==b) .
.It Fl W Ar число Fl -width Ar число
Выводить не более
.Ar числа
столбцов при использовании формата "бок о бок".
Значение по умолчанию — 130.
.It Fl -changed-group-format Ar GFMT
Форматировать входные группы в предоставленном
.Pp
формат — это строка со специальными ключевыми словами:
.Bl -tag -width %<
.It %<
строки из ФАЙЛА1
.It %<
строки из ФАЙЛА2
.El
.It Fl -ignore-file-name-case
игнорировать регистр при сравнении имён файлов
.It Fl -no-ignore-file-name-case
не игнорировать регистр при сравнении имён файлов (по умолчанию)
.It Fl -normal
вывод diff по умолчанию
.It Fl -speed-large-files
заглушка для совместимости с GNU diff
.It Fl -strip-trailing-cr
удалять возврат каретки во входных файлах
.It Fl -suppress-common-lines
Не выводить общие строки при использовании формата "бок о бок"
.It Fl -tabsize Ar число
Количество пробелов, представляющих табуляцию (по умолчанию 8)
.El
.Pp
Параметры сравнения каталогов:
.Bl -tag -width Ds
.It Fl N -new-file
Если файл найден только в одном каталоге, действовать так, как если бы он был найден и в
другом каталоге, но имел нулевой размер.
.It Fl P -unidirectional-new-file
Если файл найден только в
.Ar каталоге2 ,
действовать так, как если бы он был найден и в
.Ar каталоге1 ,
но имел нулевой размер.
.It Fl r -recursive
Применять
.Nm
рекурсивно к встречающимся общим подкаталогам.
.It Fl S Ar имя Fl -starting-file Ar имя
Перезапускать сравнение каталогов
.Nm
в середине, начиная с файла
.Ar имя .
.It Fl s -report-identical-files
Заставляет
.Nm
сообщать о файлах, которые одинаковы, о которых в противном случае не упоминается.
.It Fl X Ar файл Fl -exclude-from Ar файл
Исключать файлы и подкаталоги из сравнения, базовые имена которых соответствуют
строкам в
.Ar файле .
Можно указать несколько
.Fl X
параметров.
.It Fl x Ar шаблон Fl -exclude Ar шаблон
Исключать файлы и подкаталоги из сравнения, базовые имена которых соответствуют
.Ar шаблону .
Шаблоны сопоставляются с использованием glob-стиля оболочки через
.Xr fnmatch 3 .
Можно указать несколько
.Fl x
параметров.
.El
.Pp
Если оба аргумента являются каталогами,
.Nm
сортирует содержимое каталогов по имени, а затем запускает
алгоритм сравнения обычных файлов
.Nm ,
выдавая список изменений,
для текстовых файлов, которые различаются.
О двоичных файлах, которые различаются,
общих подкаталогах и файлах, которые появляются только в одном каталоге,
сообщается как таковых.
В режиме каталога сравниваются только обычные файлы и каталоги.
Если встречен необычный файл, такой как файл устройства или FIFO,
выводится диагностическое сообщение.
.Pp
Если только один из
.Ar файл1
и
.Ar файл2
является каталогом,
.Nm
применяется к некаталогу и файлу, содержащемуся в
каталоге, с именем файла, которое совпадает с
последним компонентом имени некаталога.
.Pp
Если
.Ar файл1
или
.Ar файл2
равно
.Sq - ,
вместо него используется
стандартный ввод.
.Ss Стиль вывода
Вывод по умолчанию (без параметров
.Fl e ,
.Fl c ,
или
.Fl n -rcs
)
содержит строки следующих форм, где
.Va XX , YY , ZZ , QQ
— номера строк, соответствующие порядку файлов.
.Pp
.It Li XX Ns Ic a Ns Li YY
В (конце) строки
.Va XX
в
.Ar файле1
добавить содержимое
строки
.Va YY
из
.Ar файла2
, чтобы сделать их равными.
.It Li XX Ns Ic a Ns Li YY,ZZ
То же, что выше, но добавить диапазон строк,
.Va YY
по
.Va ZZ
из
.Ar файла2
к строке
.Va XX
файла1.
.It Li XX Ns Ic d Ns Li YY
В строке
.Va XX
удалить
строку.
Значение
.Va YY
показывает, к какой строке изменение приведёт
.Ar файл1
в соответствие с
.Ar файлом2 .
.It Li XX,YY Ns Ic d Ns Li ZZ
Удалить диапазон строк
.Va XX
по
.Va YY
в
.Ar файле1 .
.It Li XX Ns Ic c Ns Li YY
Изменить строку
.Va XX
в
.Ar файле1
на строку
.Va YY
в
.Ar файле2 .
.It Li XX,YY Ns Ic c Ns Li ZZ
Заменить указанный диапазон строк строкой
.Va ZZ .
.It Li XX,YY Ns Ic c Ns Li ZZ,QQ
Заменить диапазон
.Va XX , Ns Va YY
из
.Ar файла1
диапазоном
.Va ZZ , Ns Va QQ
из
.Ar файла2 .
.El
.Pp
Эти строки напоминают
команды
.Xr ed 1
для преобразования
.Ar файла1
в
.Ar файл2 .
Номера строк перед буквами действия относятся к
.Ar файлу1 ;
те, что после, — к
.Ar файлу2 .
Таким образом, поменяв местами
.Ic a
на
.Ic d
и прочитав строки в обратном порядке, можно также
определить, как преобразовать
.Ar файл2
в
.Ar файл1 .
Как в
.Xr ed 1 ,
идентичные
пары (где num1 = num2) сокращаются до одного
числа.
.Sh ФАЙЛЫ
.Bl -tag -width /tmp/diff.XXXXXXXX -compact
.It Pa /tmp/diff.XXXXXXXX
Временный файл, используемый при сравнении устройства или стандартного ввода.
Обратите внимание, что временный файл удаляется сразу после создания,
поэтому он не появится в списке каталога.
.El
.Sh СТАТУС ВЫХОДА
Утилита
.Nm
завершает работу со следующим значением:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It 0
Различий не найдено.
.It 1
Найдены различия.
.It >1
Произошла ошибка.
.El
.Sh ПРИМЕРЫ
Сравнить
.Pa old_dir
и
.Pa new_dir
рекурсивно, генерируя унифицированное сравнение и рассматривая файлы, найденные только в одном
из этих каталогов, как новые файлы:
.Bd -literal -offset indent
$ diff -ruN /path/to/old_dir /path/to/new_dir
.Ed
.Pp
То же, что выше, но исключая файлы, соответствующие выражениям
.Dq *.h
и
.Dq *.c :
.Bd -literal -offset indent
$ diff -ruN -x '*.h' -x '*.c' /path/to/old_dir /path/to/new_dir
.Ed
.Pp
Показать одну строку, указывающую, различаются ли файлы:
.Bd -literal -offset indent
$ diff -q /boot/loader.conf /boot/defaults/loader.conf
Files /boot/loader.conf and /boot/defaults/loader.conf differ
.Ed
.Pp
Предположим, есть файл с именем
.Pa example.txt
со следующим содержимым:
.Bd -literal -offset indent
FreeBSD is an operating system
Linux is a kernel
OpenBSD is an operating system
.Ed
.Pp
Сравнить стандартный ввод с
.Pa example.txt
исключая из сравнения те строки, которые содержат либо
.Qq Linux
, либо
.Qq Open :
.Bd -literal -offset indent
.Ed
.Sh СМ. ТАКЖЕ
.Xr cmp 1 ,
.Xr comm 1 ,
.Xr diff3 1 ,
.Xr ed 1 ,
.Xr patch 1 ,
.Xr pr 1 ,
.Xr sdiff 1
.Rs
.%A James W. Hunt
.%A M. Douglas McIlroy
.%J Computing Science Technical Report
.%Q Bell Laboratories 41
.%D June 1976
.Re
.Sh СТАНДАРТЫ
Утилита
.Nm
соответствует спецификации
.St -p1003.1-2008 .
.Pp
Флаги
.Op Fl aDdIiLlNnPpqSsTtwXxy
являются расширениями к этой спецификации.
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.At v6 .
