freebsd-doc-ru/freebsd-man-ru/man/15.0R/ru.UTF-8/man1/fstat.1
.\" Copyright (c) 1987, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)fstat.1	8.3 (Berkeley) 2/25/94
.\"
.\" FRDP path ./usr.bin/fstat/fstat.1
.\" FRDP githash 0ba51e3b638424597add4212958524c9b750dd7b
.\" FRDP hash256 330eba61fe78ecce1f811d2f0ae50710f649f4755dd661d4ca59f5276799413c
.Dd 19 ноября 2020
.Dt FSTAT 1
.Os
.Sh ИМЯ
.Nm fstat
.Nd идентифицировать активные файлы
.Sh СИНТАКСИС
.Nm
.Op Fl fmnsv
.Op Fl M Ar core
.Op Fl N Ar system
.Op Fl p Ar pid
.Op Fl u Ar user
.Op Ar
.Sh ОПИСАНИЕ
Утилита
.Nm
идентифицирует открытые файлы.
Файл считается открытым процессом, если он был явно открыт,
является рабочим каталогом, корневым каталогом, корневым каталогом клетки,
активным исполняемым текстом или файлом трассировки ядра для этого процесса.
Если опции не указаны,
.Nm
отчитывается обо всех открытых файлах в системе для процессов, к которым у пользователя есть доступ.
.Pp
Доступны следующие опции:
.It Fl f
Ограничить проверку файлами, открытыми в тех же файловых системах, что и
указанные файловые аргументы, или файловой системой, содержащей
текущий каталог, если нет дополнительных аргументов с именами файлов.
Например, чтобы найти все файлы, открытые в файловой системе, где
находится каталог
.Pa /usr/src
, введите
.Ql fstat -f /usr/src .
.It Fl M Ar core
Извлечь значения, связанные со списком имён, из указанного файла core
вместо используемого по умолчанию
.Pa /dev/kmem .
.It Fl m
Включить файлы, отображённые в память, в список; обычно они исключаются
из-за требуемой дополнительной обработки.
.It Fl N Ar system
Извлечь список имён из указанной системы вместо используемой по умолчанию,
которая является образом ядра, с которого загрузилась система.
.It Fl n
Числовой формат.
Вывести номер устройства (старший, младший) файловой системы,
в которой находится файл, вместо имени точки монтирования; для специальных
файлов вывести
номер устройства, на который ссылается специальное устройство, вместо имени файла
в
.Pa /dev ;
и вывести режим файла в восьмеричном виде вместо символьного представления.
.It Fl p Ar pid
Отчитаться обо всех файлах, открытых указанным процессом.
.It Fl s
Вывести информацию о конечных точках сокетов.
.It Fl u Ar user
Отчитаться обо всех файлах, открытых указанным пользователем.
.It Fl v
Подробный режим.
Выводить сообщения об ошибках при неудачных попытках найти определённые
системные структуры данных, вместо их молчаливого игнорирования.
Большинство
этих структур данных создаются или удаляются динамически, и возможно их
исчезновение во время работы
.Nm .
Это
нормально и неизбежно, поскольку остальная система работает, пока
работает сам
.Nm .
.It Ar
Ограничить отчёты указанными файлами.
.El
.Pp
Выводятся следующие поля:
.Bl -tag -width MOUNT
.It Sy ПОЛЬЗОВАТЕЛЬ
Имя владельца процесса (эффективный uid).
.It Sy КОМАНДА
Имя команды процесса.
.It Sy ПИД
Идентификатор процесса.
.It Sy ФД
Номер файла в таблице открытых файлов процесса или одно из следующих
специальных имён:
.Pp
.Bl -tag -width jail -offset indent -compact
.It Sy клетка
корневой каталог клетки
.It Sy mmap
файл, отображённый в память
.It Sy root
корневой индексный дескриптор
.It Sy text
исполняемый индексный дескриптор текста
.It Sy tr
файл трассировки ядра
.It Sy wd
текущий рабочий каталог
.El
.Pp
Если номер файла сопровождается звёздочкой
.Pq Ql * ,
файл
не является индексным дескриптором, а представляет собой сокет, FIFO или произошла ошибка.
В этом случае оставшаяся часть строки не
соответствует остальным заголовкам — формат строки
описан ниже в разделе
.Sx СОКЕТЫ .
.It Sy МОНТИРОВАНИЕ
Если флаг
.Fl n
не указан, этот заголовок присутствует и представляет собой
путь, по которому смонтирована файловая система, содержащая файл.
.It Sy УСТРОЙСТВО
Если указан флаг
.Fl n
, этот заголовок присутствует и представляет собой
номер устройства, на котором находится этот файл.
.It Sy ИНОД
Номер индексного дескриптора файла.
.It Sy РЕЖИМ
Режим файла.
Если флаг
.Fl n
не указан, режим выводится
в символьном формате (см.
.Xr strmode 3 ) ;
иначе режим выводится
в виде восьмеричного числа.
.It Sy РАЗМЕР\&|УСТР
Если файл является семафором,
выводит текущее значение семафора.
Если файл не является специальным символьным или блочным, выводит размер
файла в байтах.
Иначе, если флаг
.Fl n
не указан, выводит
имя специального файла, как он расположен в
.Pa /dev .
Если его не удаётся
найти, или указан флаг
.Fl n
, выводит старший/младший номер устройства,
на который ссылается специальное устройство.
.It Sy Чт/Зп
Этот столбец описывает режим доступа, который файл разрешает.
Буква
.Ql r
указывает на открытие для чтения;
буква
.Ql w
указывает на открытие для записи.
Это поле полезно при попытке найти процессы, которые
мешают понижению уровня файловой системы до режима "только чтение".
.It Sy ИМЯ
Если указаны аргументы с именами файлов и флаг
.Fl f
отсутствует, то
это поле присутствует и является именем, связанным с данным файлом.
Обычно имя не может быть определено, поскольку нет отображения
от открытого файла обратно к записи каталога, которая была использована для открытия
этого файла.
Кроме того, поскольку разные записи каталога могут ссылаться
на один и тот же файл (через
.Xr ln 1 ) ,
выведенное имя может не быть фактическим
именем, которое процесс изначально использовал для открытия этого файла.
.El
.Sh СОКЕТЫ
Форматирование открытых сокетов зависит от домена протокола.
Во всех случаях первое поле — это имя домена, второе поле —
тип сокета (потоковый, датаграммный и т.д.), а третье — поле флагов сокета (в шестнадцатеричном виде).
Оставшиеся поля зависят от протокола.
Для TCP это адрес tcpcb, а для UDP — inpcb (сокет pcb).
Для сокетов домена UNIX — это адрес сокета pcb и адрес
подключённого pcb (если подключён).
В противном случае выводятся номер протокола и адрес самого сокета.
.Pp
Например, упомянутые выше адреса — это адреса, которые команда
.Ql netstat -A
вывела бы для TCP, UDP и UNIX-домена.
Обратите внимание, что поскольку каналы реализованы с использованием сокетов, канал появляется как
подключённый потоковый сокет домена UNIX.
Односторонний сокет домена UNIX указывает направление потока данных
стрелкой
.Po Ql <-
или
.Ql ->
.Pc ,
а полнодуплексный сокет показывает двойную стрелку
.Pq Ql <-> .
.Pp
При использовании флага
.Fl s
информация о конечных точках сокета отображается после адреса
сокета.
Для интернет-сокетов показываются локальный и удалённый адреса, разделённые
двойной стрелкой
.Pq Ql <-> .
Для UNIX/локальных сокетов показывается либо локальный, либо удалённый адрес, в зависимости
от того, какой из них доступен.
.Sh СТАТУС ВЫХОДА
.Ex -std
.Sh ПРИМЕРЫ
Показать все открытые файлы, кроме открытых самим
.Nm
:
.Bd -literal -offset indent
ПОЛЬЗОВАТЕЛЬ     КОМАНДА          ПИД   ФД МОНТИРОВАНИЕ      ИНОД РЕЖИМ         РАЗМЕР|УСТРОЙСТВО Чт/Зп
alice  bash         469 text /usr/local 143355 -rwxr-xr-x  1166448  r
alice  bash         469 ctty /dev        346 crw--w----  pts/81 rw
\&...
.Ed
.Pp
Отчитаться обо всех файлах, открытых текущей оболочкой в той же файловой системе, что и
.Pa /usr/local
, включая файлы, отображённые в память:
.Bd -literal -offset indent
$ fstat -m -p $$ -f /usr/local
ПОЛЬЗОВАТЕЛЬ     КОМАНДА          ПИД   ФД МОНТИРОВАНИЕ      ИНОД РЕЖИМ         РАЗМЕР|УСТРОЙСТВО Чт/Зп
bob  bash         469 text /usr/local 143355 -rwxr-xr-x  1166448  r
bob  bash         469 mmap /usr/local 143355 -rwxr-xr-x  1166448  r
\&...
.Ed
.Pp
Запрос информации о файле, который не открыт, приводит только к выводу
строки заголовка вместо ошибки:
.Bd -literal -offset indent
$ fstat /etc/rc.conf
ПОЛЬЗОВАТЕЛЬ     КОМАНДА          ПИД   ФД МОНТИРОВАНИЕ      ИНОД РЕЖИМ         РАЗМЕР|УСТРОЙСТВО Чт/Зп ИМЯ
.Ed
.Pp
Все параметры после
.Fl f
будут интерпретированы как файлы, поэтому следующее не сработает как ожидалось:
.Bd -literal -offset indent
$ fstat -f /usr/local -m -p $$
fstat: -m: No such file or directory
fstat: -p: No such file or directory
fstat: 469: No such file or directory
\&...
.Ed
.Pp
Показать количество каналов, открытых процессами firefox:
.Bd -literal -offset indent
.Ed
.Pp
Показать процессы, принадлежащие пользователю
.Dq bob
, у которых дескриптор стандартной ошибки открыт в ttyv0:
.Bd -literal -offset indent
bob  firefox    77842    2 /dev        103 crw-------   ttyv0 rw
bob  xinit       1194    2 /dev        103 crw-------   ttyv0 rw
\&...
.Ed
.Pp
Показать открытые TCP-сокеты.
Этот вывод похож на вывод команды
.Ql netstat -A -p tcp
:
.Bd -literal -offset indent
alice  firefox    77991   32* internet stream tcp fffff800b7f147a0
alice  firefox    77991  137* internet stream tcp fffff800b7f12b70
\&...
.Ed
.Pp
Показать список процессов с файлами, открытыми в текущем каталоге,
имитируя вывод
.Xr fuser 1
:
.Bd -literal -offset indent
2133wd(alice) 2132wd(alice) 1991wd(alice)
.Ed
.Pp
Создать список процессов, отсортированный по количеству открытых файлов в порядке убывания:
.Bd -literal -offset indent
$ fstat | awk 'NR > 1 {print $2;}' | sort | uniq -c | sort -r
 728 firefox
  23 bash
  14 sort
   8 fstat
   7 awk
.Ed
.Sh СМ. ТАКЖЕ
.Xr fuser 1 ,
.Xr netstat 1 ,
.Xr nfsstat 1 ,
.Xr procstat 1 ,
.Xr ps 1 ,
.Xr sockstat 1 ,
.Xr systat 1 ,
.Xr tcp 4 ,
.Xr unix 4 ,
.Xr iostat 8 ,
.Xr pstat 8 ,
.Xr vmstat 8
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.Bx 4.3 tahoe .
.Sh ИЗВЕСТНЫЕ ОШИБКИ
Поскольку
.Nm
делает снимок системы, он корректен только в течение очень короткого периода
времени.
