freebsd-doc-ru/freebsd-man-ru/man/15.0R/ru.UTF-8/man1/login.1
.\" $Id$
.\"
.\" FRDP path ./crypto/heimdal/appl/login/login.1
.\" FRDP githash ae77177087c655fc883075af4f425b37e032cd05
.\" FRDP hash256 e87803b647cf3d48093f9b0481dc9abc954338203ebbfa7094190837218c3168
.Dd 22 апреля 2005
.Dt LOGIN 1
.Os HEIMDAL
.Sh ИМЯ
.Nm login
.Nd аутентифицировать пользователя и начать новый сеанс
.Sh СИНТАКСИС
.Nm
.Op Fl fp
.Op Fl a Ar уровень
.Op Fl h Ar имя_хоста
.Ar [имя_пользователя]
.Sh ОПИСАНИЕ
Данная справочная страница документирует программу
.Nm login ,
распространяемую с реализацией Heimdal Kerberos 5, которая может
существенно отличаться от версии в вашей системе.
.Pp
Программа
.Nm login
осуществляет вход пользователей в систему. Предполагается её запуск
системными демонами, такими как
.Xr getty 8
или
.Xr telnetd 8 .
Если вы уже вошли в систему, но хотите переключиться на другого пользователя,
следует использовать
.Xr su 1 .
.Pp
Имя пользователя может быть указано в командной строке, в противном случае
оно будет запрошено.
.Pp
Для входа требуется пароль, если не указана опция
.Fl f
(что указывает на то, что вызывающая программа уже выполнила
надлежащую аутентификацию). С опцией
.Fl f
пользователь будет введён в систему без дополнительных вопросов.
.Pp
Для аутентификации по паролю поддерживаются Kerberos 5, Kerberos 4 (если
включён при компиляции), OTP (если включён) и локальные
.No ( Pa /etc/passwd )
пароли. OTP будет использован, если пользователь зарегистрирован для его
использования и
.Nm login
получила опцию
.Fl a Li otp .
При использовании OTP пользователю показывается запрос (challenge).
.Pp
Дополнительные опции:
.Bl -tag -width Ds
.It Fl a Ar строка
Какой режим аутентификации использовать; в настоящее время единственное
поддерживаемое значение —
.Dq otp .
.It Fl f
Указывает, что пользователь уже аутентифицирован. Это происходит, например,
когда login запускается telnetd, и пользователь доказал свою подлинность через
Kerberos.
.It Fl h Ar имя_хоста
Указывает, с какого хоста происходит вход пользователя. Эта информация
передаётся от telnetd и заносится в базу данных входов.
.It Fl p
Говорит
.Nm login
сохранить все переменные окружения. Если не указана, сохраняются только
переменные
.Dv TERM
и
.Dv TZ .
Передача случайных переменных в
.Nm login
или оболочку пользователя может представлять угрозу безопасности, поэтому
вызывающий демон должен убедиться, что передаёт только
.Dq безопасные
переменные.
.El
.Pp
Процесс входа пользователя происходит следующим образом.
.Pp
Сначала проверяется, разрешены ли вообще входы. Обычно это означает проверку
файла
.Pa /etc/nologin .
Если он существует и пытающийся войти пользователь не является root,
содержимое файла выводится, и login завершает работу.
.Pp
Затем настраиваются различные системные параметры, такие как смена владельца
терминала (tty) на пользователя, настройка сигналов, списка групп, а также
идентификаторов пользователя и группы. Также выполняются различные
машино-специфичные задачи.
.Pp
Далее
.Nm login
переходит в домашний каталог пользователя, либо, если это не удаётся, в
.Pa / .
Настраивается окружение путём добавления некоторых обязательных переменных
(таких как
.Dv PATH ) ,
а также связанных с аутентификацией (таких как
.Dv KRB5CCNAME ) .
Если существует файл переменных окружения
.No ( Pa /etc/environment ) ,
переменные устанавливаются в соответствии с ним.
.Pp
Если настроен один или несколько файлов сообщений при входе (login message),
их содержимое выводится на терминал.
.Pp
Если настроена команда, выполняемая при входе, она запускается. Также может
быть настроена команда, выполняемая при выходе, что заставляет
.Nm login
создать дочерний процесс, ждать завершения оболочки пользователя, а затем
выполнить команду. Это может использоваться для очистки учётных данных
пользователя.
.Pp
Наконец, запускается оболочка пользователя. Если входящий пользователь — root,
и его оболочка входа не существует, также пробуется оболочка по умолчанию
(обычно
.Pa /bin/sh )
прежде чем сдаться.
.Sh ОКРУЖЕНИЕ
Эти переменные окружения устанавливаются login (не включая установленные
файлом
.Pa /etc/environment ) :
.Pp
.Bl -tag -compact -width USERXXLOGNAME
.It Dv PATH
системный путь по умолчанию
.It Dv HOME
домашний каталог пользователя (или, возможно,
.Pa / )
.It Dv USER , Dv LOGNAME
обе устанавливаются в имя пользователя
.It Dv SHELL
оболочка пользователя
.It Dv TERM , Dv TZ
устанавливаются в то, что передано в
.Nm login
.It Dv KRB5CCNAME
если пароль проверен через Kerberos 5, будет указывать на файл кэша
учётных данных
.It Dv KRBTKFILE
если пароль проверен через Kerberos 4, будет указывать на файл билета
.El
.Sh ФАЙЛЫ
.Bl -tag -compact -width Ds
.It Pa /etc/environment
Содержит набор переменных окружения, которые должны быть установлены в
дополнение к указанным выше. Он должен содержать присваивания в стиле sh,
например
.Dq ПЕРЕМЕННАЯ=значение .
Обратите внимание, что они разбираются не так, как это делает оболочка.
Подстановка переменных не выполняется, все строки воспринимаются буквально,
и кавычки использовать не следует. Всё после знака решётки считается
комментарием. Следующие строки различны (последняя установит переменную
.Dv BAR ,
а не
.Dv FOO ) .
.Bd -literal -offset indent
FOO=this is a string
BAR= FOO='this is a string'
.Ed
.It Pa /etc/login.access
Смотрите
.Xr login.access 5 .
.It Pa /etc/login.conf
Это файл конфигурации в стиле termcap, содержащий различные настройки,
используемые
.Nm login .
В настоящее время используется только запись возможностей
.Dq default .
Возможные строки возможностей включают:
.Pp
.Bl -tag -compact -width Ds
.It Li environment
Это список, разделённый запятыми, файлов окружения, которые читаются в
указанном порядке. Если отсутствует, используется
.Pa /etc/environment
по умолчанию.
.It Li login_program
Эта программа будет выполнена непосредственно перед запуском оболочки
пользователя. Она будет вызвана без аргументов.
.It Li logout_program
Эта программа будет выполнена сразу после завершения оболочки пользователя.
Она будет вызвана без аргументов. Эта программа будет родительским процессом
для порождённой оболочки.
.It Li motd
Список, разделённый запятыми, текстовых файлов, которые будут выведены на
терминал пользователя перед запуском оболочки. Строка
.Li welcome
работает аналогично, но указывает на один файл.
.It Li limits
Указывает на файл, содержащий настройки ulimit для различных пользователей.
Синтаксис вдохновлён тем, что использует pam_limits, по умолчанию это
.Pa /etc/security/limits.conf .
.El
.It Pa /etc/nologin
Если существует, вход запрещён всем, кроме root. Содержимое этого файла
выводится перед завершением работы login.
.El
.Pp
Другие версии программы
.Nm login
обычно выводят по умолчанию различную информацию, такую как время последнего
входа, наличие почты и файлы системных сообщений. Эта версия
.Nm login
этого не делает, поэтому нет необходимости в файлах
.Pa .hushlogin
или подобных. Мы считаем, что эти задачи лучше оставить оболочке
пользователя, но возможность
.Li login_program
позволяет реализовать независимое от оболочки решение, если это желательно.
.Sh ПРИМЕРЫ
Файл
.Pa login.conf
может выглядеть так:
.Bd -literal -offset indent
default:\\
	:motd=/etc/motd,/etc/motd.local:\\
	:limits=/etc/limits.conf:
.Ed
.Pp
Файл
.Pa limits.conf
состоит из таблицы с четырьмя полями, разделёнными пробелами. Первое поле —
имя пользователя или имя группы (с префиксом
.Sq @ ) ,
или
.Sq * .
Второе поле —
.Sq soft ,
.Sq hard ,
или
.Sq -
(последнее означает и мягкое, и жёсткое ограничение).
Третье поле — имя ограничения (например,
.Sq cpu
или
.Sq core ) .
Последнее поле — значение ограничения (число или
.Sq -
для неограниченного). В случае размеров данных значение указано в килобайтах,
а время процессора — в минутах.
.Sh СМ. ТАКЖЕ
.Xr su 1 ,
.Xr login.access 5 ,
.Xr getty 8 ,
.Xr telnetd 8
.Sh АВТОРЫ
Данная программа login была написана для реализации Heimdal Kerberos 5.
Код для login.access был написан Wietse Venema.
